In [2]:
import pandas as pd

# Sample DataFrame
data = {
    'Name': ['Raju', 'Bheem', 'Kalia'],
    'Math': [85, 78, 92],
    'Science': [90, 82, 89],
    'English': [88, 85, 94]
}

df = pd.DataFrame(data)

# Display the DataFrame
print(df)

    Name  Math  Science  English
0   Raju    85       90       88
1  Bheem    78       82       85
2  Kalia    92       89       94

In [10]:
# df.melt(id_vars=["Name"], value_vars=["Math", "Science", "English"], var_name="Subject", value_name="Score", col_level=None)
df2 = df.melt(id_vars=["Name"], value_vars=["Math", "Science", "English"], var_name="Subject", value_name="Score")

In [11]:
df2

    Name  Subject  Score
0   Raju     Math     85
1  Bheem     Math     78
2  Kalia     Math     92
3   Raju  Science     90
4  Bheem  Science     82
5  Kalia  Science     89
6   Raju  English     88
7  Bheem  English     85
8  Kalia  English     94

In [24]:
df2.pivot(index = "Name", columns ="Subject", values = "Score")

Subject  English  Math  Science
Name
Bheem         85    78       82
Kalia         94    92       89
Raju          88    85       90

In [23]:
df2

    Name  Subject  Score
0   Raju     Math     85
1  Bheem     Math     78
2  Kalia     Math     92
3   Raju  Science     90
4  Bheem  Science     82
5  Kalia  Science     89
6   Raju  English     88
7  Bheem  English     85
8  Kalia  English     94

In [25]:
# Sample DataFrame
data = {
    'Name': ['Raju', 'Bheem', 'Kalia','Raju', 'Bheem', 'Kalia','Raju', 'Bheem', 'Kalia',],
    'Subject': ['Math','Math','Math','Science','Science','Science','English','English','English'],
    'Score': [85,78,92,90,82,89,88,85,94],
    }

df2 = pd.DataFrame(data)

# Display the DataFrame
print(df2)

    Name  Subject  Score
0   Raju     Math     85
1  Bheem     Math     78
2  Kalia     Math     92
3   Raju  Science     90
4  Bheem  Science     82
5  Kalia  Science     89
6   Raju  English     88
7  Bheem  English     85
8  Kalia  English     94

In [26]:
df2.pivot(index = "Name", columns ="Subject", values = "Score")

Subject  English  Math  Science
Name
Bheem         85    78       82
Kalia         94    92       89
Raju          88    85       90

In [27]:
df_pivot = df2.pivot(index="Name", columns="Subject", values="Score")
df_pivot.columns.name = None        # Remove "Subject" label above columns
df_pivot.reset_index(inplace=True)  # Make "Name" a regular column
print(df_pivot)

    Name  English  Math  Science
0  Bheem       85    78       82
1  Kalia       94    92       89
2   Raju       88    85       90